Австралия/src/Catalogs/EarningAndDeductionTypes/EarningAndDeductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EarningAndDeductionTypes</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>InterestOnLoan</name>
      <description>Interest on loan</description>
    </items>
    <items>
      <name>PieceRatePay</name>
      <description>Piece-rate pay</description>
    </items>
    <items>
      <name>PieceRatePayFixedAmount</name>
      <description>Piece-rate pay (fixed amount)</description>
    </items>
    <items>
      <name>PieceRatePayPercent</name>
      <description>Piece-rate pay (percent)</description>
    </items>
    <items>
      <name>RepaymentOfLoanFromSalary</name>
      <description>Repayment of loan from salary</description>
    </items>
  </predefined>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.EarningAndDeductionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>GLExpenseAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Formula</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxKind</name>
    <type>
      <types>CatalogRef.TaxTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>IncomeAndExpenseItem</name>
    <type>
      <types>CatalogRef.IncomeAndExpenseItems</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/AccumulationRegisters/EarningsAndDeductions/EarningsAndDeductions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>EarningsAndDeductions</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DaysWorked</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HoursWorked</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Size</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RegistrationPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>EarningAndDeductionType</name>
    <type>
      <types>CatalogRef.EarningAndDeductionTypes</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Enums/GLAccountsTypes/GLAccountsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>GLAccountsTypes</name>
  <enumValues>
    <name>AccountsPayable</name>
  </enumValues>
  <enumValues>
    <name>AccountsReceivable</name>
  </enumValues>
  <enumValues>
    <name>Capital</name>
  </enumValues>
  <enumValues>
    <name>CashAndCashEquivalents</name>
  </enumValues>
  <enumValues>
    <name>CostOfSales</name>
  </enumValues>
  <enumValues>
    <name>Depreciation</name>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
  </enumValues>
  <enumValues>
    <name>Header</name>
  </enumValues>
  <enumValues>
    <name>IncomeTax</name>
  </enumValues>
  <enumValues>
    <name>IndirectExpenses</name>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
  </enumValues>
  <enumValues>
    <name>LoanInterest</name>
  </enumValues>
  <enumValues>
    <name>LoansBorrowed</name>
  </enumValues>
  <enumValues>
    <name>LongtermLiabilities</name>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
  </enumValues>
  <enumValues>
    <name>OtherFixedAssets</name>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
  </enumValues>
  <enumValues>
    <name>OtherShorttermObligations</name>
  </enumValues>
  <enumValues>
    <name>ProfitLosses</name>
  </enumValues>
  <enumValues>
    <name>ReserveAndAdditionalCapital</name>
  </enumValues>
  <enumValues>
    <name>RetailMarkup</name>
  </enumValues>
  <enumValues>
    <name>RetainedEarnings</name>
  </enumValues>
  <enumValues>
    <name>Revenue</name>
  </enumValues>
  <enumValues>
    <name>ShorttermInvestments</name>
  </enumValues>
  <enumValues>
    <name>WorkInProgress</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/EarningAndDeductionTypes/EarningAndDeductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EarningAndDeductionTypes</name>
  <enumValues>
    <name>Earning</name>
  </enumValues>
  <enumValues>
    <name>Deduction</name>
  </enumValues>
  <enumValues>
    <name>Tax</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/DefaultGLAccounts/DefaultGLAccounts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DefaultGLAccounts</name>
  <predefined>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
    </items>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
    </items>
    <items>
      <name>AdvanceHolders</name>
      <description>Advance holders</description>
    </items>
    <items>
      <name>AdvanceHoldersPayable</name>
      <description>Advance holders payable</description>
    </items>
    <items>
      <name>AdvancesToSuppliers</name>
      <description>Advances to suppliers</description>
    </items>
    <items>
      <name>BankAccount</name>
      <description>Bank account</description>
    </items>
    <items>
      <name>BankFeesCreditAccount</name>
      <description>Bank fees credit account</description>
    </items>
    <items>
      <name>BankFeesExpenseAccount</name>
      <description>Bank fees expense account</description>
    </items>
    <items>
      <name>CapitalIntroduction</name>
      <description>Capital introduction</description>
    </items>
    <items>
      <name>CashAccount</name>
      <description>Cash account</description>
    </items>
    <items>
      <name>CommissionExpensesOnLoansBorrowed</name>
      <description>Commission expenses on loans borrowed</description>
    </items>
    <items>
      <name>CommissionIncomeOnLoansLent</name>
      <description>Commission income on loans lent</description>
    </items>
    <items>
      <name>CostOfSales</name>
      <description>Cost of sales</description>
    </items>
    <items>
      <name>CreditCardSalesReceivedAtALaterDate</name>
      <description>Credit card sales received at a later date</description>
    </items>
    <items>
      <name>CustomerAdvances</name>
      <description>Customer advances</description>
    </items>
    <items>
      <name>DiscountAllowed</name>
      <description>Discount allowed</description>
    </items>
    <items>
      <name>DiscountReceived</name>
      <description>Discount received</description>
    </items>
    <items>
      <name>Expenses</name>
      <description>Expenses</description>
    </items>
    <items>
      <name>FixedAssets</name>
      <description>Fixed assets</description>
    </items>
    <items>
      <name>FixedAssetsDepreciation</name>
      <description>Fixed assets depreciation</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeGain</name>
      <description>Foreign currency exchange gain</description>
    </items>
    <items>
      <name>ForeignCurrencyExchangeLoss</name>
      <description>Foreign currency exchange loss</description>
    </items>
    <items>
      <name>FundsTransfersBeingProcessed</name>
      <description>Funds transfers being processed</description>
    </items>
    <items>
      <name>GoodsInTransit</name>
      <description>Goods in transit</description>
    </items>
    <items>
      <name>IncomeSummary</name>
      <description>Income summary</description>
    </items>
    <items>
      <name>InterestExpensesOnLoansBorrowed</name>
      <description>Interest expenses on loans borrowed</description>
    </items>
    <items>
      <name>InterestIncome</name>
      <description>Interest income</description>
    </items>
    <items>
      <name>InterestPayable</name>
      <description>Interest payable</description>
    </items>
    <items>
      <name>InterestReceivable</name>
      <description>Interest receivable</description>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
    </items>
    <items>
      <name>LoansBorrowed</name>
      <description>Loans borrowed</description>
    </items>
    <items>
      <name>LoansLentToCounerparty</name>
      <description>Loans lent to counterparty</description>
    </items>
    <items>
      <name>LoansLentToEmployee</name>
      <description>Loans lent to employee</description>
    </items>
    <items>
      <name>OpeningBalanceEquity</name>
      <description>Opening balance equity account (to balance opening entries)</description>
    </items>
    <items>
      <name>OtherIncome</name>
      <description>Other income</description>
    </items>
    <items>
      <name>PayrollExpenses</name>
      <description>Payroll expenses</description>
    </items>
    <items>
      <name>PayrollPayable</name>
      <description>Payroll payable</description>
    </items>
    <items>
      <name>PettyCashAccount</name>
      <description>Petty cash account</description>
    </items>
    <items>
      <name>PurchaseCostDiscrepancies</name>
      <description>Purchase cost discrepancies</description>
    </items>
    <items>
      <name>RetailMarkup</name>
      <description>Retail markup for retail inventory method</description>
    </items>
    <items>
      <name>TaxPayable</name>
      <description>Tax payable</description>
    </items>
    <items>
      <name>TaxRefund</name>
      <description>Tax refund</description>
    </items>
    <items>
      <name>VATInput</name>
      <description>VAT input</description>
    </items>
    <items>
      <name>VATAdvancesToSuppliers</name>
      <description>VAT on advance payments paid to suppliers</description>
    </items>
    <items>
      <name>VATAdvancesFromCustomers</name>
      <description>VAT on advance payments received from customers</description>
    </items>
    <items>
      <name>VATOutput</name>
      <description>VAT output</description>
    </items>
    <items>
      <name>VATReverseCharge</name>
      <description>VAT reverse charge</description>
    </items>
    <items>
      <name>WorkInProgress</name>
      <description>Work-in-progress</description>
    </items>
    <items>
      <name>WriteOffOverUnderMOHToCOGS</name>
      <description>Write-off over/underallocated manufacturing overheads to COGS</description>
    </items>
  </predefined>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
</mdclass:Catalog>

Австралия/src/Catalogs/EarningAndDeductionTypes/Forms/GLAccountsEditForm/Module.bsl
#Region ServiceProceduresAndFunctions

// Procedure for creating the owner form notification about the change of account
//
&AtClient
Procedure NotifyAccountChange()
	
	ParameterStructure = New Structure("GLExpenseAccount", GLExpenseAccount);
	Notify("AccountsChangedEarningAndDeductionTypes", ParameterStructure);
	
EndProcedure

// Function checks GL account change option.
//
&AtServer
Function CancelGLExpenseAccountChange(EarningAndDeductionType)
	
	Query = New Query(
	"SELECT ALLOWED
	|	EarningsAndDeductions.Period,
	|	EarningsAndDeductions.Recorder,
	|	EarningsAndDeductions.LineNumber,
	|	EarningsAndDeductions.Active,
	|	EarningsAndDeductions.Company,
	|	EarningsAndDeductions.PresentationCurrency,
	|	EarningsAndDeductions.StructuralUnit,
	|	EarningsAndDeductions.Employee,
	|	EarningsAndDeductions.RegistrationPeriod,
	|	EarningsAndDeductions.Currency,
	|	EarningsAndDeductions.EarningAndDeductionType,
	|	EarningsAndDeductions.Amount,
	|	EarningsAndDeductions.AmountCur,
	|	EarningsAndDeductions.StartDate,
	|	EarningsAndDeductions.EndDate,
	|	EarningsAndDeductions.DaysWorked,
	|	EarningsAndDeductions.HoursWorked,
	|	EarningsAndDeductions.Size
	|FROM
	|	AccumulationRegister.EarningsAndDeductions AS EarningsAndDeductions
	|WHERE
	|	EarningsAndDeductions.EarningAndDeductionType = &EarningAndDeductionType");
	
	Query.SetParameter("EarningAndDeductionType", ?(ValueIsFilled(EarningAndDeductionType), EarningAndDeductionType, Undefined));
	
	Result = Query.Execute();
	
	Return Not Result.IsEmpty();
	
EndFunction

// Procedure fills the data structure for the GL account selection.
//
&AtServer
Procedure ReceiveDataForSelectAccountsSettlements(DataStructure)
	
	GLAccountsAvailableTypes = New Array;
	EarningAndDeductionType = DataStructure.EarningAndDeductionType;
	If Not ValueIsFilled(EarningAndDeductionType) Then
		
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.WorkInProgress);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.IndirectExpenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.Expenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherExpenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherFixedAssets);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherIncome);
		
	ElsIf EarningAndDeductionType.Type = Enums.EarningAndDeductionTypes.Earning Then
		
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.WorkInProgress);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.IndirectExpenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.Expenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherExpenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherFixedAssets);
		
	ElsIf EarningAndDeductionType.Type = Enums.EarningAndDeductionTypes.Deduction Then
		
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherIncome);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.Expenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.IndirectExpenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherExpenses);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.AccountsPayable);
		GLAccountsAvailableTypes.Add(Enums.GLAccountsTypes.OtherShorttermObligations);
		
	EndIf;
	
	DataStructure.Insert("GLAccountsAvailableTypes", GLAccountsAvailableTypes);
	
EndProcedure

// Procedure sets the link of selection parameters for the "GL expense account" attribute
//
&AtServer
Procedure SetConnectionSelectAtServerParameters()
	
	DataStructure = New Structure;
	DataStructure.Insert("EarningAndDeductionType", EarningAndDeductionType);
		
	ReceiveDataForSelectAccountsSettlements(DataStructure);
	
	NewArray = New Array;
	NewParameter = New ChoiceParameter("Filter.TypeOfAccount", New FixedArray(DataStructure.GLAccountsAvailableTypes));
	NewArray.Add(NewParameter);
	ChoiceParameters = New FixedArray(NewArray);
	Items.GLExpenseAccount.ChoiceParameters = ChoiceParameters
	
EndProcedure

#EndRegion

#Region FormEventsHandlers

// Procedure - event handler of the OnCreateAtServer form
//
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	GLExpenseAccount		= Parameters.GLExpenseAccount;
	EarningAndDeductionType	= Parameters.Ref;
	IsTax					= (EarningAndDeductionType.Type = Enums.EarningAndDeductionTypes.Tax);
	
	SetConnectionSelectAtServerParameters();
	
	If CancelGLExpenseAccountChange(EarningAndDeductionType) Then
		
		Items.GLAccountsGroup.ToolTip	= NStr("en = 'Records are registered for this type of earning (deduction) in the infobase. Cannot change the GL account.'; ru = 'В базе есть движения по этому типу начисления (удержания). Изменение счета учета запрещено!';pl = 'W bazie informacyjnej są zarejestrowane zapisy dla tego rodzaju naliczeń (odliczeń) w bazie informacyjnej. Nie można zmienić konta ewidencji.';es_ES = 'Grabaciones se han registrado para este tipo de ingreso (deducción) en la infobase. No se puede cambiar la cuenta del libro mayor.';es_CO = 'Grabaciones se han registrado para este tipo de ingreso (deducción) en la infobase. No se puede cambiar la cuenta del libro mayor.';tr = 'Veritabanındaki bu tür gelir (kesinti) için kayıtlar kaydedilir. Muhasebe hesabı değiştirilemez.';it = 'Le registrazioni sono registrate per questa tipologia di compensi (trattenute) nell''infobase. Impossibile modificare il conto mastro.';de = 'Aufzeichnungen werden für diese Art von Bezug (Abzug) in der Infobase registriert. Das Hauptbuch-Konto kann nicht geändert werden.'");
		Items.GLAccountsGroup.Enabled	= False;
		Items.Default.Visible			= False;
		
	EndIf;
	
EndProcedure

// Procedure - event handler of the OnCreateAtServer form
//
&AtClient
Procedure OnOpen(Cancel)
	
	If IsTax Then
		
		ShowMessageBox(, NStr("en = 'GL accounts are not edited for the Tax Earning kind.'; ru = 'Для типа вида начисления Налог счета учета не редактируются!';pl = 'Konta księgowe nie są edytowane w związku z naliczaniem dochodu podatkowego.';es_ES = 'Cuentas del libro mayor no se han editado para el tipo de Ingreso Fiscal.';es_CO = 'Cuentas del libro mayor no se han editado para el tipo de Ingreso Fiscal.';tr = 'Vergi tahakkuku için Muhasebe hesapları düzenlenmez.';it = 'I conti mastro non vengono modificati per la tipologia di Imposta per Compensi.';de = 'Hauptbuch-Konten werden nicht für die Arten von Steuerbezügen bearbeitet.'"));
		Cancel = True;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandsHandlers

// Procedure - command handler by default.
//
&AtClient
Procedure Default(Command)
	
	GLExpenseAccount = GetDefaultExpensesAccount();
	NotifyAccountChange();
	
EndProcedure

&AtServerNoContext
Function GetDefaultExpensesAccount()	
	Return Catalogs.DefaultGLAccounts.GetDefaultGLAccount("PayrollExpenses");	
EndFunction

#EndRegion

#Region FormAttributesEventsHandlers

&AtClient
Procedure GLExpenseAccountOnChange(Item)
	
	If NOT ValueIsFilled(GLExpenseAccount) Then	
		GLExpenseAccount = GetDefaultExpensesAccount();
	EndIf;
	
	NotifyAccountChange();
	
EndProcedure

#EndRegion
